killweiwiei/RBLink_V3.0/esp32c3/sdkconfig.defaults
CONFIG_IDF_TARGET="esp32c3"
CONFIG_ESPTOOLPY_FLASHSIZE_4MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="4MB"
CONFIG_PARTITION_TABLE_SINGLE_APP_LARGE=y
CONFIG_ESP_MAIN_TASK_STACK_SIZE=4096
CONFIG_FREERTOS_HZ=1000
CONFIG_LWIP_MAX_SOCKETS=12
CONFIG_ESP_WIFI_SOFTAP_SUPPORT=y
CONFIG_ESP_WIFI_STA_DISCONNECTED_PM_ENABLE=n
CONFIG_ESP_CONSOLE_UART_DEFAULT=y
CONFIG_RBLINK_AP_SSID_PREFIX="RBlink"
CONFIG_RBLINK_AP_PASSWORD="RBlinkV30!"
CONFIG_RBLINK_TCP_PORT=3240
CONFIG_RBLINK_SPI_QUEUE_DEPTH=8
CONFIG_HTTPD_WS_SUPPORT=y
